{"inkVersion":21,"root":[[{"->":"Start_CompScience"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Start_CompScience":[["^You attend orientation. You don't know what to expect from this choice you made a few months ago. Your decision often raised eyebrows when you discussed university plans with your friends. \"You're doing Computer Science?\" were frequent questions that you didn't think need more than one clarification with that much incredulity.","\n","^Still, you decide to stick to it. You take a deep think about why you picked the major.","\n","ev","str","^You were always fascinated by computers, programming, and how things worked behind the screen.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^You simply heard from family that it was a lucrative degree with a bright future.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"Bess_passion_path"},"\n",{"#f":5}],"c-1":["^ ",{"->":"Bess_money_path"},"\n",{"#f":5}]}],{"#f":1}],"Bess_passion_path":[["^You constantly remind yourself that you belong in this major, and will stick by the choice.","\n","ev","str","^Start School.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":".^.^.^.PP_W1"},"\n",{"#f":5}]}],{"PP_W1":[["^You enjoy Week Zero and Week One, having plenty of fun meeting friends from different majors. You think to yourself: \"This is pretty fun!\"","\n","^You navigate the complexities of ModReg, try out CCAs and travel out for suppers with your new friends. You also spend some time decorating your room.","\n","^You attend your first lectures for CS1101S, the programming methodology module, and CS1231S, the notoriously difficult Discrete Math module. It takes you some time to process what is going on, but you do not worry too much about it.","\n","^You learn words such as ternary operators, looking something like this:","\n","^(A True or False condition) ? (Expression if true) : (Expression if false)","\n","^\"Cool! You think to yourself.\"","\n","ev","str","^Start tutorials in Week Three.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":".^.^.^.^.PP_W3_tutorial"},"\n",{"#f":5}]}],{"#f":1}],"PP_W3_tutorial":["^With little to no warning, the content suddenly picks up. CS1101S has weekly assignments, which take you a surprising amount of time to solve. Discrete Math also presents as challenging, with many new concepts such as boolean algebra.","\n","^One day, at your CS1101S tutorial, your teaching assistant calls you out in the group of six.","\n","^Bess, can you write out how a ternary operation would look like if you passed your exam, with the expressions being your emotion?","\n","^You are shocked and your mind goes temporarily blank. What do you say? (PS: Google if you're stuck!)","\n",{"->":".^.^.PP_W3_tutorial_question"},{"#f":1}],"PP_W3_tutorial_question":[["^Task: Write out how a ternary operation would look like if you passed your exam, with the two expressions being your emotion","\n","ev","str","^(Pass exam) : (Happy) ? (Sad)","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^(Pass exam) : (Sad) ? (Happy)","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^(Pass exam) ? (Sad) : (Happy)","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^(Pass exam) ? (Happy) : (Sad)","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ You write it out, but he gently pushes, \"Are your symbols correct?\" ","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["^ You write it out, but he winks, \"If pass exam is true, why would you be sad? The symbols look a little wrong too.\" ","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["^ You write it out, but he promises you're close. \"If pass exam is true, why would you be sad?\" ","\n",{"->":".^.^.^"},{"#f":5}],"c-3":["^ You write out the answer. \"That's correct, good job Bess!\" responds your TA. ","\n",{"->":".^.^.^.^.PP_W3_tutorial_answer"},{"#f":5}]}],{"#f":1}],"PP_W3_tutorial_answer":[["^You are shaken but heave a sigh of relief. You go back and do a little more revision.","\n","^Outside of academics, you've always wanted to be more involved in student life, but you have a feeling you might not be able to keep up with too many commitments.","\n","^What do you plan to do?","\n","ev","str","^Join Floorball.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Apply to join Frisbee.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Apply for both.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Choose not to apply for anything. ","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n","ev",{"VAR?":"CCAs"},1,"+",{"VAR=":"CCAs","re":true},"/ev","ev","str","^Floorball","/str","/ev",{"VAR=":"CCA_name","re":true},{"->":".^.^.^.^.PP_W3_end"},{"#f":5}],"c-1":["\n","ev",{"VAR?":"CCAs"},1,"+",{"VAR=":"CCAs","re":true},"/ev","ev","str","^Frisbee","/str","/ev",{"VAR=":"CCA_name","re":true},{"->":".^.^.^.^.PP_W3_end"},{"#f":5}],"c-2":["^ ","\n","ev",{"VAR?":"CCAs"},2,"+",{"VAR=":"CCAs","re":true},"/ev","ev","str","^Floorball and Frisbee","/str","/ev",{"VAR=":"CCA_name","re":true},{"->":".^.^.^.^.PP_W3_end"},{"#f":5}],"c-3":["\n","ev","str","^none","/str","/ev",{"VAR=":"CCA_name","re":true},{"->":".^.^.^.^.PP_W3_end"},{"#f":5}]}],{"#f":1}],"PP_W3_end":[["^You decide on ","ev",{"VAR?":"CCA_name"},"out","/ev","^.","\n","^However, the workload shows no signs of ceasing. You are also taking Linear Algebra, for which you have been trying to keep up by attending lectures at 8AM. You struggle to get your sleep and find yourself turning down many offers from your friends to have supper.","\n","^You also find it hard to difficult to ask for help from your friends. You feel bad and don't want to appear foolish.","\n","ev","str","^Start Week 4.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":".^.^.^.^.PP_W4_start"},"\n",{"#f":5}]}],{"#f":1}],"PP_W4_start":[["^The weekly coding problems come incessantly, and you wonder if it will ever end. You become aware of a \"practical exam\" coming soon where you have an hour and a half to solve six coding problems.","\n","^Bearing in mind you have to practice for them, you also start working on the linear algebra and discrete math assignment due before recess week.","\n","^It is very difficult, and initially you are extremely lost. You are only able to do a few questions.","\n","^Furthermore, you have to write essays for your University Level Requirement modules.","\n","^Overwhelmed, you close your eyes and begin to tear up.","\n","ev","str","^Keep your head down and continue working.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Consider giving up.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":".^.^.^.^.PP_W6_start"},"\n",{"#f":5}],"c-1":["^ You consider giving up, so you text one of your friends and share your predictament. She gently tells you that giving up and letting the workload snowball will not add to your relief. She tells you to just do what you can and then decide after Semester 1. ",{"->":".^.^.^.^.PP_W6_start"},"\n",{"#f":5}]}],{"#f":1}],"PP_W6_start":[["^Recess Week peeks around the corner. You keep your head down and push your way through deadline after deadline.","\n","^You also manage to complete the assignments with much difficulty, did your best for the practical exam and the quizzes.","\n","^You find yourself saving your meetups with friends you genuinely appreciate and slowly acclimatise to the constant state of rigour. You are more comfortable with saying no to CCA trainings.","\n","ev","str","^Start Recess Week","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":".^.^.^.^.PP_Recess_week_start"},"\n",{"#f":5}]}],{"#f":1}],"PP_Recess_week_start":[["^Recess week is spent practicising past year papers. It is difficult to remain focussed, but you do your best anyway.","\n","^You sit for the examinations the week after.","\n","ev","str","^Finish your last paper.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.^.^.SSH_Post_Exams"},{"#f":5}]}],{"#f":1}],"SSH_Post_Exams":[["^You heave a sigh of relief as you finish your last paper. It didn't go especially bad, but neither did it go exceedingly well. You take a good long break, and treat yourself to a mala with friends at UTown, with some GongCha.","\n","^It is not long later that you receive an email for your results.","\n","ev","str","^View results.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ","\n","ev",{"VAR?":"CCAs"},"/ev",["du","ev",0,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","^You choose to view your results, and your perform surprisingly well. You achieved a mix of of A-s and B+s. You were able to keep up with the workload, and had time after class to revise the concepts again. A plus for not having any CCAs, you wonder to yourself.","\n","ev",{"VAR?":"grades"},3,"+","/ev",{"VAR=":"grades","re":true},"ev","str","^Start Week 8.","/str","/ev",{"*":".^.c-0","flg":20},{"->":".^.^.^.8"},{"c-0":["^ ",{"->":".^.^.^.^.^.^.^.PP_W8_start"},"\n",{"#f":5}]}]}],["du","ev",1,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","^You choose to view your results, and your perform not too poorly. You achieved a mix of of A-s and B+s. You were able to keep up with most of the workload, and attempted revise after class the concepts again. \"Just one CCA\" might work for me\", you think to yourself.","\n","ev",{"VAR?":"grades"},2,"+","/ev",{"VAR=":"grades","re":true},"ev","str","^Start Week 8.","/str","/ev",{"*":".^.c-0","flg":20},{"->":".^.^.^.8"},{"c-0":[{"->":".^.^.^.^.^.^.^.PP_W8_start"},"\n",{"#f":5}]}]}],[{"->":".^.b"},{"b":["pop","\n","^You choose to view your results, and you perform on average. You achieved a mix of of B+s and a B. You feel frustrated, but you remember that you missed a few lectures due to the CCA volume and did not keep up consistently with the workload. Regardless, you pick yourself up, and you say to yourself: \"It is what it is\".","\n","ev",{"VAR?":"grades"},1,"+","/ev",{"VAR=":"grades","re":true},"ev","str","^Start Week 8.","/str","/ev",{"*":".^.c-0","flg":20},{"->":".^.^.^.8"},{"c-0":["^ ",{"->":".^.^.^.^.^.^.^.PP_W8_start"},"\n",{"#f":5}]}]}],"nop","\n",{"#f":5}]}],{"#f":1}],"PP_W8_start":[["^You are able to catch a little breather.","\n","^You brush yourself off, treat yourself to a nice meal, and take a deep breath before lessons go into full swing again.","\n","ev","str","^Start Week 9.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":".^.^.^.^.PP_W9_start"},"\n",{"#f":5}]}],{"#f":1}],"PP_W9_start":["^With little warning, the workload spikes again. This time, you are mentally more prepared.","\n","ev",{"VAR?":"CCAs"},"/ev",["du","ev",0,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":".^.^.^.^.PP_W10_start"},{"->":".^.^.^.8"},null]}],["du","ev",1,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","^Your ","ev",{"VAR?":"CCA_name"},"out","/ev","^ CCA is opening applications for EXCO positions for the next semester. Do you want to try out for it?","\n","ev","str","^Try out for EXCO position.","/str","/ev",{"*":".^.c-0","flg":20},{"->":".^.^.^.8"},{"c-0":["^ You try to run for the Captain for ","ev",{"VAR?":"CCA_name"},"out","/ev","^. The very same week, you have a small speech on how you envision the club to look like, and the things you want to change. ","\n","ev",{"VAR?":"leadership_roles"},1,"+",{"VAR=":"leadership_roles","re":true},"/ev","^Week 10 begins. ",{"->":".^.^.^.^.^.PP_W10_start"},"\n",{"#f":5}]}]}],[{"->":".^.b"},{"b":["pop","\n","^Both ","ev",{"VAR?":"CCA_name"},"out","/ev","^ are opening applications for EXCO positions for the next semester. Do you want to join?","\n","ev","str","^Try out for Floorball EXCO.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Try out for Frisbee EXCO.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Choose not to.","/str","/ev",{"*":".^.c-2","flg":20},{"->":".^.^.^.8"},{"c-0":["^ You try to run for the Captain for Floorball. The very same week, you have a small speech on how you envision the club to look like, and the things you want to change.","\n","ev",{"VAR?":"leadership_roles"},1,"+",{"VAR=":"leadership_roles","re":true},"/ev",{"->":".^.^.^.^.^.PP_W10_start"},{"#f":5}],"c-1":["^ You try to run for the Captain for Frisbee. The very same week, you have a small speech on how you envision the club to look like, and the things you want to change.","\n","ev",{"VAR?":"leadership_roles"},1,"+",{"VAR=":"leadership_roles","re":true},"/ev",{"->":".^.^.^.^.^.PP_W10_start"},{"#f":5}],"c-2":["^ ",{"->":".^.^.^.^.^.PP_W10_start"},"\n",{"#f":5}]}]}],"nop","\n",{"#f":1}],"PP_W10_start":[["^The days flash by quickly and you operate by weeks now. Another wave of \"practical exam\", written assignments and essays come your way.","\n","^You stay afloat.","\n","ev","str","^Submit essay for ULR module","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ You submit your essay that you have made countless revisions to. Alongside, your written assignments for discrete math and linear algebra. ","\n",{"->":".^.^.^.^.PP_Reading_Week"},{"#f":5}]}],{"#f":1}],"PP_Reading_Week":[["^Reading Week starts and you find yourself practicising past year papers individually in your room. However, the math questions are not easy which makes you feel very stressed. You are also less productive than you expect, and only start halfway into the week.","\n","^Before long, it is Sunday, but you have one more practice paper you want to cram before the Linear Algebra exam tomorrow at 9AM. What do you choose to do?","\n","ev","str","^Ignore the paper and decide sleep is more important.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Do the paper because you are stressed.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ You decide to go to bed instead, at 12AM. ","\n","ev",2,"/ev",{"VAR=":"sleep_amount","re":true},{"->":".^.^.^.^.PP_Start_Exam"},{"#f":5}],"c-1":["^ You decide to do it, and go to bed at 2AM. ","\n","ev",1,"/ev",{"VAR=":"sleep_amount","re":true},{"->":".^.^.^.^.PP_Start_Exam"},{"#f":5}]}],{"#f":1}],"PP_Start_Exam":[["ev",{"VAR?":"sleep_amount"},"/ev",["du","ev",1,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","^The examination goes reasonably well. With the extra sleep, you feel refreshed and are able to answer the auestions easily. However, you found out later that one of the questions came out in the past year paper that you didn't do. Regardless, you think to yourself: \"If I didn't get enough sleep, I might not have been able to answer the other questions\".","\n","^You continue working through the other exams and winter begins shortly.","\n",{"->":".^.^.^.6"},null]}],["du","ev",2,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","^The examination goes reasonably well. With lesser sleep, you start to feel lethargic towards the end. Thankfully however, the last question came out in the past year paper that you attempted the night before.","\n","^You continue working through the other exams and soon winter begins shortly.","\n",{"->":".^.^.^.6"},null]}],"pop","nop","\n","ev",{"VAR?":"leadership_roles"},0,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^However, before summer starts, you are informed that you were voted in as the captain for ","ev",{"VAR?":"CCA_name"},"out","/ev","^. You are surprised but also nervous. Next semester will definitely be busy and you have to stay on the ball.","\n",{"->":".^.^.^.15"},null]}],[{"->":".^.b"},{"b":["\n","^Winter comes round the corner.","\n",{"->":".^.^.^.15"},null]}],"nop","\n","ev","str","^Start Winter.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":".^.^.^.^.PP_Start_Winter"},"\n",{"#f":5}]}],{"#f":1}],"PP_Start_Winter":[["^You move out of campus residence back home.","\n","^Here is how your Winter plans currently look like:","\n",["^Go overseas with your family for a week in Vietnam","\n","^You have a few options on how to fill the rest of your 3 weeks.","\n","ev","str","^Rest, you are exhausted.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Self-learn next semester's topics.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ You take a long rest, and let out the deepest sigh you have ever known. ",{"->":".^.^.^.^.^.PP_post_S1_think"},"\n",{"#f":5}],"c-1":["^ You try to do so, but you feel hopelessly burnt out. You cannot bring yourself to continue consistently. ",{"->":".^.^.^.^.^.PP_post_S1_think"},"\n",{"#f":5}],"#f":5,"#n":"g-0"}],null],{"#f":1}],"PP_post_S1_think":["^You sit down and take a deep think. You remind yourself you took this major out of interest, but you were always interested in the application. How websites work, how traffic systems work and how Google finds the best routes to places. Not ternary operations, Relations, and Gaussian Elimination.","\n","^You mull over it a little longer, until you slowly come to terms with the present. \"It is, what it is,\" you tell yourself.","\n",{"->":"PP_Sem2_Starts"},{"#f":1}],"#f":1}],"PP_Sem2_Starts":["^School starts again! You move back into hall, albeit tiring, and complete the frustrating ModReg period easier than last semester.","\n","^This time, your modules include: GEA1000, CS2030S (the continuation of CS1101S), CS2040S (Data structures and Algorithms), MA1521 (Calculus) and a random module for fun.","\n","^Before you start, you remind yourself to keep up with lectures, remain consistent, and be willing to turn down meetings if you are too stressed. You also decide to work with your friends instead of alone. ",{"->":".^.PP_S2_W3"},"\n",{"PP_S2_W3":["^As anticipated, a lot of content was covered within the first few weeks. You realise that weekly coding problems have returned, and the first is the assignment known for its \"rite-of-passage\" difficulty.","\n","^You grit your teeth and take the assignments head on. ",{"->":".^"},"\n",{"#f":1}],"PP_S2_W6":[["^Slowly, you start to find your rhythm once again. Watch lectures, complete assignments with friends, attend ","ev",{"VAR?":"CCA_name"},"out","/ev","^ training, and sleep in on Sundays.","\n","^Before long, recess week starts again, and you settle into your groove.","\n","ev","str","^Finish Mid-Terms","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.^.^.PP_S2_Post_Midterms"},{"#f":5}]}],{"#f":1}],"PP_S2_Post_Midterms":["^Midterms are over. You nervously check your results soon after.","\n","ev",{"VAR?":"leadership_roles"},"/ev",["du","ev",0,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","^Thankfully, your hard work has paid off and you are happy with your grades. Some B+s.","\n","ev","str","^Move on.","/str","/ev",{"*":".^.c-0","flg":20},{"->":".^.^.^.8"},{"c-0":["^ You hang out with friends and get yourself a little treat for your hard work.","\n",{"->":".^.^.^.^.^.PP_S2_Commitments"},{"#f":5}]}]}],["du","ev",1,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","^You achieve some B+s and a B. You are satisfied with your performance!","\n","ev","str","^Move on.","/str","/ev",{"*":".^.c-0","flg":20},{"->":".^.^.^.8"},{"c-0":["^ You pick yourself up and dust yourself off. You also get yourself a little treat for your hard work.","\n",{"->":".^.^.^.^.^.PP_S2_Commitments"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["pop","\n","^You achieve mostly Bs and a single B+. You have been overloaded with commitments and lagged behind in content. You are unsurprised, but also disappointed.","\n","ev","str","^Move on.","/str","/ev",{"*":".^.c-0","flg":20},{"->":".^.^.^.8"},{"c-0":["^ You pick yourself up and dust yourself off. You get yourself a little treat for your hard work.","\n",{"->":".^.^.^.^.^.PP_S2_Commitments"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"PP_S2_Commitments":[["^Things continue to be difficult. You discover your code does not compile for the practical exam, resulting in a straight zero. All you can say is, \"It is what it is\".","\n","^Planning for CCA also proves to be difficult, but thankfully you enjoy the sport and love the community that your seniors have helped to build. Furthermore, your vice-captain has also been very supportive and takes up the slack when needed. It is during this time you become painfully grateful for your support system of friends during such a difficult period.","\n","^It is also during this time where a familiar male friend starts to talk to you more often. You do not think much about it, and continue maintaining your flow of things.","\n","ev","str","^Start Reading Week","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.^.^.PP_S2_Reading_Week"},{"#f":5}]}],{"#f":1}],"PP_S2_Reading_Week":[["^\"It is funny how time makes you forget how painful things were in the past,\" you think to yourself. Reading Week does not get any easier, as you do paper after paper. Slowly, you gain a little more confience each time.","\n","^You sit for the exams the week after.","\n","ev","str","^Finish your last paper.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.^.^.PP_S2_Post_Exams"},{"#f":5}]}],{"#f":1}],"PP_S2_Post_Exams":[["^You manage to achieve satisfactory grades this time, pulling the CAP to a 4.0.","\n","ev","str","^Prepare for Summer.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"SSH_Start_Summer"},"\n",{"#f":5}]}],{"#f":1}],"#f":1}],"SSH_Start_Summer":[["^It is time to move out.","\n","^Before you know it, Year 1 comes to an end. You reflect on your successes and failures, and evaluate whether your goals have been met.","\n","^You decide on a few things on your last night in your little room you called home.","\n","ev","str","^Apply for internship.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Pursue Orbital, a summer module where you code a project in pairs.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Backpack and travel.","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ You decide to accept the internship you thoughtlessly applied for in Semester 1. With that, you drift off to sleep, ending your first academic year in NUS.","end","\n",{"#f":5}],"c-1":["^ You decide you might as well clear 4MCs, and also try out coding something totally new. You think about a text-based adventure, where NUS students can choose their path. ","end","\n",{"#f":5}],"c-2":["^ You decide you need a rest for the summer, and things as they come. With that, you plan potential destinations, and drift off to sleep, ending your first academic year in NUS. ","end","\n",{"#f":5}]}],{"#f":1}],"Bess_money_path":["end",{"#f":1}],"global decl":["ev",0,{"VAR=":"grades"},0,{"VAR=":"consistency"},0,{"VAR=":"leadership_roles"},0,{"VAR=":"CCAs"},0,{"VAR=":"interest_to_try"},0,{"VAR=":"rizz"},"str","^","/str",{"VAR=":"CCA_name"},"str","^side hustle","/str",{"VAR=":"side_hustle"},"str","^","/str",{"VAR=":"business_name"},0,{"VAR=":"friends"},0,{"VAR=":"sleep_amount"},"str","^","/str",{"VAR=":"specialisation_choice"},"/ev","end",null],"#f":1}],"listDefs":{}}